-- --------------------------------------------------------
-- 호스트:                          127.0.0.1
-- 서버 버전:                        8.0.19 - MySQL Community Server - GPL
-- 서버 OS:                        Win64
-- HeidiSQL 버전:                  11.0.0.5919
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;


-- portfolio 데이터베이스 구조 내보내기
CREATE DATABASE IF NOT EXISTS `portfolio` /*!40100 DEFAULT CHARACTER SET utf8 */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `portfolio`;

-- 테이블 portfolio.admin 구조 내보내기
CREATE TABLE IF NOT EXISTS `admin` (
  `idk` int NOT NULL,
  `id` varchar(45) NOT NULL,
  `pw` varchar(45) NOT NULL,
  PRIMARY KEY (`idk`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- 테이블 데이터 portfolio.admin:~0 rows (대략적) 내보내기
DELETE FROM `admin`;
/*!40000 ALTER TABLE `admin` DISABLE KEYS */;
INSERT INTO `admin` (`idk`, `id`, `pw`) VALUES
	(1, 'admin', 'admin1234');
/*!40000 ALTER TABLE `admin` ENABLE KEYS */;

-- 테이블 portfolio.bar_data 구조 내보내기
CREATE TABLE IF NOT EXISTS `bar_data` (
  `idk` int NOT NULL AUTO_INCREMENT,
  `patient` int NOT NULL,
  `gap` int NOT NULL,
  `day` datetime NOT NULL,
  `update_time` datetime NOT NULL,
  PRIMARY KEY (`idk`)
) ENGINE=InnoDB AUTO_INCREMENT=50 DEFAULT CHARSET=utf8;

-- 테이블 데이터 portfolio.bar_data:~26 rows (대략적) 내보내기
DELETE FROM `bar_data`;
/*!40000 ALTER TABLE `bar_data` DISABLE KEYS */;
INSERT INTO `bar_data` (`idk`, `patient`, `gap`, `day`, `update_time`) VALUES
	(1, 10765, 4, '2020-04-30 00:00:00', '2020-05-06 13:14:48'),
	(2, 10774, 9, '2020-05-01 00:00:00', '2020-05-06 13:15:37'),
	(3, 10780, 6, '2020-05-02 00:00:00', '2020-05-06 13:16:08'),
	(4, 10793, 13, '2020-05-03 00:00:00', '2020-05-06 13:16:55'),
	(5, 10801, 8, '2020-05-04 00:00:00', '2020-05-06 13:17:34'),
	(6, 10804, 3, '2020-05-05 00:00:00', '2020-05-06 13:18:12'),
	(7, 10806, 2, '2020-05-06 00:00:00', '2020-05-06 13:18:40'),
	(8, 10810, 4, '2020-05-07 00:00:00', '2020-05-07 20:02:27'),
	(9, 10822, 12, '2020-05-08 00:00:00', '2020-05-09 17:23:08'),
	(10, 10840, 18, '2020-05-09 00:00:00', '2020-05-09 17:23:34'),
	(11, 10874, 34, '2020-05-10 00:00:00', '2020-05-10 17:09:54'),
	(12, 10909, 35, '2020-05-11 00:00:00', '2020-05-12 18:47:23'),
	(13, 10936, 27, '2020-05-12 00:00:00', '2020-05-12 18:47:55'),
	(14, 10962, 26, '2020-05-13 00:00:00', '2020-05-14 17:51:32'),
	(15, 10991, 29, '2020-05-14 00:00:00', '2020-05-14 17:52:28'),
	(21, 11018, 27, '2020-05-15 00:00:00', '2020-05-15 14:20:39'),
	(29, 11037, 19, '2020-05-16 00:00:00', '2020-05-16 10:58:37'),
	(30, 11050, 13, '2020-05-17 00:00:00', '2020-05-17 14:14:51'),
	(38, 11065, 15, '2020-05-18 00:00:00', '2020-05-18 14:02:20'),
	(40, 11078, 13, '2020-05-19 00:00:00', '2020-05-19 15:15:34'),
	(41, 11110, 32, '2020-05-20 00:00:00', '2020-05-20 16:08:00'),
	(43, 11122, 12, '2020-05-21 00:00:00', '2020-05-21 17:02:21'),
	(44, 11142, 20, '2020-05-22 00:00:00', '2020-05-22 12:08:59'),
	(45, 11165, 23, '2020-05-24 00:00:00', '2020-05-24 09:58:02'),
	(47, 11190, 25, '2020-05-24 00:00:00', '2020-05-24 12:39:21'),
	(48, 11206, 16, '2020-05-25 00:00:00', '2020-05-25 00:00:00'),
	(49, 11225, 19, '2020-05-26 00:00:00', '2020-05-26 21:00:23');
/*!40000 ALTER TABLE `bar_data` ENABLE KEYS */;

-- 테이블 portfolio.basket 구조 내보내기
CREATE TABLE IF NOT EXISTS `basket` (
  `basket_id` int NOT NULL AUTO_INCREMENT,
  `userid` varchar(50) NOT NULL,
  `product_num` int NOT NULL,
  `product_name` varchar(45) NOT NULL,
  `product_count` int NOT NULL,
  `price` int NOT NULL,
  `picture_url` varchar(45) NOT NULL,
  PRIMARY KEY (`basket_id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

-- 테이블 데이터 portfolio.basket:~3 rows (대략적) 내보내기
DELETE FROM `basket`;
/*!40000 ALTER TABLE `basket` DISABLE KEYS */;
INSERT INTO `basket` (`basket_id`, `userid`, `product_num`, `product_name`, `product_count`, `price`, `picture_url`) VALUES
	(4, 'test01', 5, '아이 깨끗해 거품 핸드 솝3개 ', 1, 9900, '/images/product/kid-detergent.jpg'),
	(5, 'test01', 6, '청춘 핸즈퓨리 손소독제', 1, 4500, '/images/product/chungchun-detergent.jpg'),
	(6, 'test01', 6, '청춘 핸즈퓨리 손소독제', 2, 9000, '/images/product/chungchun-detergent.jpg');
/*!40000 ALTER TABLE `basket` ENABLE KEYS */;

-- 테이블 portfolio.board 구조 내보내기
CREATE TABLE IF NOT EXISTS `board` (
  `idx` int NOT NULL AUTO_INCREMENT,
  `id` varchar(45) NOT NULL,
  `subject` varchar(45) NOT NULL,
  `contents` varchar(3000) NOT NULL,
  `count` int DEFAULT NULL,
  `regdate` datetime DEFAULT NULL,
  PRIMARY KEY (`idx`)
) ENGINE=InnoDB AUTO_INCREMENT=109 DEFAULT CHARSET=utf8;

-- 테이블 데이터 portfolio.board:~99 rows (대략적) 내보내기
DELETE FROM `board`;
/*!40000 ALTER TABLE `board` DISABLE KEYS */;
INSERT INTO `board` (`idx`, `id`, `subject`, `contents`, `count`, `regdate`) VALUES
	(1, '테스트1', '테스트 주제1', '내용1', 0, '2020-04-22 19:25:05'),
	(2, '테스트2', '테스트 주제2', '내용2', 0, '2020-04-22 19:25:05'),
	(3, '테스트3', '테스트 주제3', '내용3', 0, '2020-04-22 19:25:05'),
	(4, '테스트4', '테스트 주제4', '내용4', 0, '2020-04-22 19:25:05'),
	(5, '테스트5', '테스트 주제5', '내용5', 0, '2020-04-22 19:25:05'),
	(6, '테스트6', '테스트 주제6', '내용6', 0, '2020-04-22 19:25:05'),
	(7, '테스트7', '테스트 주제7', '내용7', 0, '2020-04-22 19:25:05'),
	(8, '테스트8', '테스트 주제8', '내용8', 0, '2020-04-22 19:25:05'),
	(9, '테스트9', '테스트 주제9', '내용9', 0, '2020-04-22 19:25:05'),
	(10, '테스트10', '테스트 주제10', '내용10', 0, '2020-04-22 19:25:06'),
	(11, '테스트11', '테스트 주제11', '내용11', 0, '2020-04-22 19:25:06'),
	(12, '테스트12', '테스트 주제12', '내용12', 0, '2020-04-22 19:25:06'),
	(13, '테스트13', '테스트 주제13', '내용13', 0, '2020-04-22 19:25:06'),
	(14, '테스트14', '테스트 주제14', '내용14', 0, '2020-04-22 19:25:06'),
	(15, '테스트15', '테스트 주제15', '내용15', 0, '2020-04-22 19:25:06'),
	(16, '테스트16', '테스트 주제16', '내용16', 0, '2020-04-22 19:25:06'),
	(17, '테스트17', '테스트 주제17', '내용17', 0, '2020-04-22 19:25:06'),
	(18, '테스트18', '테스트 주제18', '내용18', 0, '2020-04-22 19:25:06'),
	(19, '테스트19', '테스트 주제19', '내용19', 0, '2020-04-22 19:25:06'),
	(20, '테스트20', '테스트 주제20', '내용20', 0, '2020-04-22 19:25:06'),
	(21, '테스트21', '테스트 주제21', '내용21', 0, '2020-04-22 19:25:06'),
	(22, '테스트22', '테스트 주제22', '내용22', 0, '2020-04-22 19:25:06'),
	(23, '테스트23', '테스트 주제23', '내용23', 0, '2020-04-22 19:25:06'),
	(24, '테스트24', '테스트 주제24', '내용24', 0, '2020-04-22 19:25:06'),
	(25, '테스트25', '테스트 주제25', '내용25', 0, '2020-04-22 19:25:06'),
	(26, '테스트26', '테스트 주제26', '내용26', 0, '2020-04-22 19:25:06'),
	(27, '테스트27', '테스트 주제27', '내용27', 0, '2020-04-22 19:25:06'),
	(28, '테스트28', '테스트 주제28', '내용28', 0, '2020-04-22 19:25:06'),
	(29, '테스트29', '테스트 주제29', '내용29', 0, '2020-04-22 19:25:06'),
	(30, '테스트30', '테스트 주제30', '내용30', 0, '2020-04-22 19:25:06'),
	(31, '테스트31', '테스트 주제31', '내용31', 0, '2020-04-22 19:25:06'),
	(32, '테스트32', '테스트 주제32', '내용32', 0, '2020-04-22 19:25:06'),
	(33, '테스트33', '테스트 주제33', '내용33', 0, '2020-04-22 19:25:06'),
	(34, '테스트34', '테스트 주제34', '내용34', 0, '2020-04-22 19:25:06'),
	(35, '테스트35', '테스트 주제35', '내용35', 0, '2020-04-22 19:25:06'),
	(36, '테스트36', '테스트 주제36', '내용36', 0, '2020-04-22 19:25:06'),
	(37, '테스트37', '테스트 주제37', '내용37', 0, '2020-04-22 19:25:06'),
	(38, '테스트38', '테스트 주제38', '내용38', 0, '2020-04-22 19:25:06'),
	(39, '테스트39', '테스트 주제39', '내용39', 0, '2020-04-22 19:25:06'),
	(40, '테스트40', '테스트 주제40', '내용40', 0, '2020-04-22 19:25:06'),
	(41, '테스트41', '테스트 주제41', '내용41', 0, '2020-04-22 19:25:06'),
	(42, '테스트42', '테스트 주제42', '내용42', 0, '2020-04-22 19:25:06'),
	(43, '테스트43', '테스트 주제43', '내용43', 0, '2020-04-22 19:25:06'),
	(44, '테스트44', '테스트 주제44', '내용44', 0, '2020-04-22 19:25:06'),
	(45, '테스트45', '테스트 주제45', '내용45', 0, '2020-04-22 19:25:06'),
	(46, '테스트46', '테스트 주제46', '내용46', 0, '2020-04-22 19:25:06'),
	(47, '테스트47', '테스트 주제47', '내용47', 0, '2020-04-22 19:25:06'),
	(48, '테스트48', '테스트 주제48', '내용48', 0, '2020-04-22 19:25:06'),
	(49, '테스트49', '테스트 주제49', '내용49', 0, '2020-04-22 19:25:06'),
	(50, '테스트50', '테스트 주제50', '내용50', 0, '2020-04-22 19:25:06'),
	(51, '테스트51', '테스트 주제51', '내용51', 0, '2020-04-22 19:25:06'),
	(52, '테스트52', '테스트 주제52', '내용52', 0, '2020-04-22 19:25:06'),
	(53, '테스트53', '테스트 주제53', '내용53', 0, '2020-04-22 19:25:06'),
	(54, '테스트54', '테스트 주제54', '내용54', 0, '2020-04-22 19:25:06'),
	(55, '테스트55', '테스트 주제55', '내용55', 0, '2020-04-22 19:25:06'),
	(56, '테스트56', '테스트 주제56', '내용56', 0, '2020-04-22 19:25:06'),
	(57, '테스트57', '테스트 주제57', '내용57', 0, '2020-04-22 19:25:06'),
	(58, '테스트58', '테스트 주제58', '내용58', 0, '2020-04-22 19:25:06'),
	(59, '테스트59', '테스트 주제59', '내용59', 0, '2020-04-22 19:25:06'),
	(60, '테스트60', '테스트 주제60', '내용60', 0, '2020-04-22 19:25:06'),
	(61, '테스트61', '테스트 주제61', '내용61', 0, '2020-04-22 19:25:06'),
	(62, '테스트62', '테스트 주제62', '내용62', 0, '2020-04-22 19:25:06'),
	(63, '테스트63', '테스트 주제63', '내용63', 0, '2020-04-22 19:25:06'),
	(64, '테스트64', '테스트 주제64', '내용64', 0, '2020-04-22 19:25:06'),
	(65, '테스트65', '테스트 주제65', '내용65', 0, '2020-04-22 19:25:07'),
	(66, '테스트66', '테스트 주제66', '내용66', 0, '2020-04-22 19:25:07'),
	(67, '테스트67', '테스트 주제67', '내용67', 0, '2020-04-22 19:25:07'),
	(68, '테스트68', '테스트 주제68', '내용68', 0, '2020-04-22 19:25:07'),
	(69, '테스트69', '테스트 주제69', '내용69', 0, '2020-04-22 19:25:07'),
	(70, '테스트70', '테스트 주제70', '내용70', 0, '2020-04-22 19:25:07'),
	(71, '테스트71', '테스트 주제71', '내용71', 0, '2020-04-22 19:25:07'),
	(72, '테스트72', '테스트 주제72', '내용72', 0, '2020-04-22 19:25:07'),
	(73, '테스트73', '테스트 주제73', '내용73', 0, '2020-04-22 19:25:07'),
	(74, '테스트74', '테스트 주제74', '내용74', 0, '2020-04-22 19:25:07'),
	(75, '테스트75', '테스트 주제75', '내용75', 0, '2020-04-22 19:25:07'),
	(76, '테스트76', '테스트 주제76', '내용76', 0, '2020-04-22 19:25:07'),
	(77, '테스트77', '테스트 주제77', '내용77', 0, '2020-04-22 19:25:07'),
	(78, '테스트78', '테스트 주제78', '내용78', 0, '2020-04-22 19:25:07'),
	(79, '테스트79', '테스트 주제79', '내용79', 0, '2020-04-22 19:25:07'),
	(80, '테스트80', '테스트 주제80', '내용80', 0, '2020-04-22 19:25:07'),
	(81, '테스트81', '테스트 주제81', '내용81', 0, '2020-04-22 19:25:07'),
	(82, '테스트82', '테스트 주제82', '내용82', 0, '2020-04-22 19:25:07'),
	(83, '테스트83', '테스트 주제83', '내용83', 0, '2020-04-22 19:25:07'),
	(84, '테스트84', '테스트 주제84', '내용84', 0, '2020-04-22 19:25:07'),
	(85, '테스트85', '테스트 주제85', '내용85', 0, '2020-04-22 19:25:07'),
	(86, '테스트86', '테스트 주제86', '내용86', 0, '2020-04-22 19:25:07'),
	(87, '테스트87', '테스트 주제87', '내용87', 0, '2020-04-22 19:25:07'),
	(88, '테스트88', '테스트 주제88', '내용88', 0, '2020-04-22 19:25:07'),
	(89, '테스트89', '테스트 주제89', '내용89', 0, '2020-04-22 19:25:07'),
	(90, '테스트90', '테스트 주제90', '내용90', 1, '2020-04-22 19:25:07'),
	(91, '테스트91', '테스트 주제91', '내용91', 0, '2020-04-22 19:25:07'),
	(92, '테스트92', '테스트 주제92', '내용92', 2, '2020-04-22 19:25:07'),
	(93, '테스트93', '테스트 주제93', '내용93', 1, '2020-04-22 19:25:07'),
	(94, '테스트94', '테스트 주제94', '내용94', 1, '2020-04-22 19:25:07'),
	(95, '테스트95', '테스트 주제95', '내용95', 3, '2020-04-22 19:25:07'),
	(96, '테스트96', '테스트 주제96', '내용96', 2, '2020-04-22 19:25:07'),
	(97, '테스트97', '테스트 주제97', '내용97', 10, '2020-04-22 19:25:07'),
	(98, '테스트98', '테스트 주제98', '내용98', 8, '2020-04-22 19:25:07'),
	(99, '테스트99', '테스트 주제99', '내용99', 9, '2020-04-22 19:25:07');
/*!40000 ALTER TABLE `board` ENABLE KEYS */;

-- 테이블 portfolio.doughnut_data 구조 내보내기
CREATE TABLE IF NOT EXISTS `doughnut_data` (
  `idk` int NOT NULL AUTO_INCREMENT,
  `daegu` decimal(10,2) NOT NULL,
  `gyeongbuk` decimal(10,2) NOT NULL,
  `other` decimal(10,2) NOT NULL,
  `gyeonggi` decimal(10,2) NOT NULL,
  `seoul` decimal(10,2) NOT NULL,
  `day` datetime NOT NULL,
  PRIMARY KEY (`idk`)
) ENGINE=InnoDB AUTO_INCREMENT=37 DEFAULT CHARSET=utf8;

-- 테이블 데이터 portfolio.doughnut_data:~19 rows (대략적) 내보내기
DELETE FROM `doughnut_data`;
/*!40000 ALTER TABLE `doughnut_data` DISABLE KEYS */;
INSERT INTO `doughnut_data` (`idk`, `daegu`, `gyeongbuk`, `other`, `gyeonggi`, `seoul`, `day`) VALUES
	(1, 63.45, 12.64, 11.73, 6.30, 5.89, '2020-05-06 00:00:00'),
	(2, 63.42, 12.64, 11.76, 6.31, 5.89, '2020-05-07 00:00:00'),
	(3, 63.27, 12.60, 11.80, 6.35, 5.99, '2020-05-09 00:00:00'),
	(4, 63.10, 12.56, 11.88, 6.38, 6.10, '2020-05-10 00:00:00'),
	(5, 62.75, 12.50, 11.94, 6.46, 6.36, '2020-05-11 00:00:00'),
	(6, 62.75, 12.50, 11.94, 6.46, 6.36, '2020-05-12 00:00:00'),
	(7, 62.46, 12.45, 12.12, 6.50, 6.47, '2020-05-13 00:00:00'),
	(8, 62.46, 12.45, 12.12, 6.50, 6.47, '2020-05-14 00:00:00'),
	(9, 62.33, 12.42, 12.17, 6.58, 6.51, '2020-05-15 00:00:00'),
	(17, 62.41, 12.43, 11.99, 6.63, 6.55, '2020-05-16 00:00:00'),
	(18, 62.17, 12.38, 12.28, 6.65, 6.52, '2020-05-17 00:00:00'),
	(26, 62.10, 12.36, 12.34, 6.65, 6.54, '2020-05-18 00:00:00'),
	(28, 62.02, 12.38, 12.35, 6.70, 6.54, '2020-05-19 00:00:00'),
	(29, 61.85, 12.47, 12.31, 6.77, 6.62, '2020-05-20 00:00:00'),
	(30, 61.85, 12.47, 12.31, 6.77, 6.62, '2020-05-21 00:00:00'),
	(31, 61.79, 12.50, 12.30, 6.80, 6.61, '2020-05-21 00:00:00'),
	(32, 61.68, 12.57, 12.30, 6.80, 6.65, '2020-05-22 00:00:00'),
	(33, 61.56, 12.59, 12.27, 6.82, 6.75, '2020-05-24 00:00:00'),
	(34, 61.56, 12.59, 12.27, 6.82, 6.75, '2020-05-24 00:00:00'),
	(35, 61.34, 12.64, 12.29, 6.91, 6.84, '2020-05-25 00:00:00'),
	(36, 61.25, 12.66, 12.28, 6.98, 6.84, '2020-05-26 00:00:00');
/*!40000 ALTER TABLE `doughnut_data` ENABLE KEYS */;

-- 테이블 portfolio.product 구조 내보내기
CREATE TABLE IF NOT EXISTS `product` (
  `product_id` int NOT NULL AUTO_INCREMENT,
  `product_name` varchar(45) NOT NULL,
  `price` int NOT NULL,
  `description` varchar(45) DEFAULT NULL,
  `picture_url` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`product_id`),
  UNIQUE KEY `product_id_UNIQUE` (`product_id`)
) ENGINE=InnoDB AUTO_INCREMENT=25 DEFAULT CHARSET=utf8;

-- 테이블 데이터 portfolio.product:~24 rows (대략적) 내보내기
DELETE FROM `product`;
/*!40000 ALTER TABLE `product` DISABLE KEYS */;
INSERT INTO `product` (`product_id`, `product_name`, `price`, `description`, `picture_url`) VALUES
	(1, 'kf94', 1500, 'kf94 기능성황사 마스크', '/images/product/kf94.jpg'),
	(2, 'kf80', 1200, 'kf80 기능성황사 마스크', '/images/product/kf80.jpg'),
	(3, 'kn95', 1400, 'kn95 기능성황사 마스크', '/images/product/kn95.jpg'),
	(4, '비티할로 데일리뉴 핸드워시 2개', 9000, '비티할로 데일리뉴 핸드워시', '/images/product/viti-detergent.jpg'),
	(5, '아이 깨끗해 거품 핸드 솝3개 ', 9900, '아이 깨끗해 거품 핸드 솝3개', '/images/product/kid-detergent.jpg'),
	(6, '청춘 핸즈퓨리 손소독제', 4500, '청춘 핸즈퓨리 손소독제1개', '/images/product/chungchun-detergent.jpg'),
	(7, '에이스가드 방역복 ', 19000, '에이스가드 방역복1개', '/images/product/aceguard-clothing.jpg'),
	(8, '3m 원피스형 방역복', 32700, '3m 원피스형 방역복 방진복3개', '/images/product/3m-clothing.jpg'),
	(9, '3m 원피스형 방역복', 11000, '3m 원피스형 방역복 방진복1개', '/images/product/3m-clothing(1).jpg'),
	(10, '렘데시비르', 11000, '렘데시비르 1개', '/images/product/ramdae.jpg'),
	(11, '클로로퀸', 12000, '클로로퀸 1개', '/images/product/clolo.jpg'),
	(12, '타이레놀', 2500, '타이레놀 1개', '/images/product/tyrenol.jpg'),
	(13, '요플레 플레인 화이트 ', 4500, '플레인 화이트 1개', '/images/product/flaneyogurt.jpg'),
	(14, '서울우유 요구르트 ', 4000, '서울우유 요구르트 30개', '/images/product/yogurt.jpg'),
	(15, '삼육 검은참깨두유', 15000, '삼육 검은참깨두유 32개', '/images/product/soymilk.jpg'),
	(16, '찰보리', 10000, '찰보리 4kg', '/images/product/barley.jpg'),
	(17, '귀리', 5000, '귀리 1kg', '/images/product/oat.jpg'),
	(18, '들깨', 23000, '들깨 3kg', '/images/product/perilla.jpg'),
	(19, '소고기', 13000, '소고기 300g', '/images/product/beef.jpg'),
	(20, '돼지고기', 4000, '돼지고기 앞다리살 500g', '/images/product/fork.jpg'),
	(21, '고등어', 12000, '고등어 1kg', '/images/product/mackerel.jpg'),
	(22, '다진마늘', 3200, '다진마늘 500g', '/images/product/garlic.jpg'),
	(23, '고구마', 35000, '고구마 10kg', '/images/product/sweetpotato.jpg'),
	(24, '인삼', 30000, '인삼 500g', '/images/product/ginseng.jpg');
/*!40000 ALTER TABLE `product` ENABLE KEYS */;

-- 테이블 portfolio.register 구조 내보내기
CREATE TABLE IF NOT EXISTS `register` (
  `idx` int NOT NULL AUTO_INCREMENT,
  `id` varchar(45) NOT NULL,
  `name` varchar(45) NOT NULL,
  `password` varchar(45) NOT NULL,
  `birth` varchar(45) NOT NULL,
  `gender` varchar(45) NOT NULL,
  `email` varchar(45) NOT NULL,
  `phone` varchar(45) NOT NULL,
  `address` varchar(45) NOT NULL,
  PRIMARY KEY (`idx`),
  UNIQUE KEY `id_UNIQUE` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- 테이블 데이터 portfolio.register:~1 rows (대략적) 내보내기
DELETE FROM `register`;
/*!40000 ALTER TABLE `register` DISABLE KEYS */;
INSERT INTO `register` (`idx`, `id`, `name`, `password`, `birth`, `gender`, `email`, `phone`, `address`) VALUES
	(1, 'test01', '테스트', 'roqkf8754', '01', '남', 'example@naver.com', '01012345678', '서울특별시 영등포구 당산로16길 26, ㅁㅁㅇㄹ (당산동1가, 강남)');
/*!40000 ALTER TABLE `register` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
